Autodesk.Revit.DB.BuiltInFailures.SheetFailures.SheetNumberEmpty
Sheet Number is empty

Autodesk.Revit.DB.BuiltInFailures.SheetFailures.SheetNumberDuplicated
Sheet Number is already in use. Enter a unique number.

Autodesk.Revit.DB.BuiltInFailures.SheetFailures
Failures about Sheet.